Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: དམངས་ཀྱི་ཁྱིམ་གང་དང་གང་དུ་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་ཆོས་སྨྲ་བ་དང་། གཞན་ཡང་དད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤིན་ཏུ་ཁྲུས་བགྱིས་ཏེ། ཡན་ལག་ཤིན་ཏུ་བྱུགས་ནས་གོས་སར་པ་འཚལ་ཏེ། མེ་ཏོག་བཀྲམ་པའི་འཁོར་གྱི་ཁྱམས་སུ་སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་པ་རས་བཅོས་བུ་དང་རས་སྣ་ཚོགས་བཏིང་བ་རོ་བྲོ་བ་སྣ་ཚོགས་ཀྱིས་བསྐོར་བའི་སེང་གེའི་ཁྲི་ལ་འདུག་སྟེ། ལྕེའི་རྩེ་མོས་གཟུངས་ཀྱི་ཕྱག་རྒྱ་འདི་གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་འཆད་དམ་བྲིས་ཏེ། ཀློག་པ་དེར་ཆོས་ཉན་པ་ནས། ཆོས་སྨྲ་བ་དེ་བསྲུང་བའམ། ཆོས་ཉན་པ་དེ་དག་དང་། བདག་དང་གཞན་གཉི་གའི་ཉོན་མོངས་པའི་ལས་ཡོངས་སུ་སྦྱང་བའམ། དགེ་བའི་ཆོས་ཡོངས་སུ་སྨིན་པར་བགྱི་བའམ། ཆོས་ཀྱི་ཚུལ་ཆེན་པོ་ཡང་དག་པར་འབར་བར་བགྱི་བའམ། ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོ་མཆོག་གི་ལམ་ལ་འཇུག་པའི་སླད་དུ། བདག་འཁོར་བརྒྱ་སྟོང་དུ་མས་བསྐོར་ཏེ། དེར་མ་མཆིས་སམ།
en: Brahmā , lord of the Sahā world, then made a pledge to the Blessed One, “Now or in the future, as long as this sacred Dharma method still exists, should a Dharma teacher, or a faithful noble son or daughter—whether a monk or a nun, a layman or a laywoman—in any village, town, city, country, border town, capital, temple, forest, palace, brahmin household, merchant household, or common household, first bathe, anoint their body, and put on new garments and then, in a courtyard adorned with various flowers, take a seat on a lion throne that is covered with fine fabrics and linens, censed with fragrant incense, and surrounded by delicious foods and teach this dhāraṇī-seal extensively to others from the tip of their tongue or, alternatively, write it down or read it, if I do not come, surrounded by hundreds of thousands of members of my retinue, to protect that Dharma teacher and clear away the afflicted karmic actions of those Dharma students—both myself and others —and to ripen their virtuous qualities, to nurture this great Dharma method, and set them on the supreme path of the great light of wisdom—if I do not come to care for those villages . . .

source: གྲོང་ནས་དམངས་ཀྱི་ཁྱིམ་གྱི་བར་དེ་དག་ཡོངས་སུ་བསྐྱང་བ་དང་། སེམས་ཅན་དེ་དག་གི་ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་མང་པོ་རབ་ཏུ་དགང་བའི་སླད་དུ། དེར་མ་མཆིས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར་བདག་གིས། སྔོན་མ་ཐོས་པའི་བྲོ་བོར་བའི་དམ་བཅས་པ་དང་འགལ་བར་འགྱུར་རོ།
en: and common households and fill their treasuries and granaries with wealth and grain, then I will have transgressed the unprecedented vow I took before the blessed buddhas.

source: །འདི་ལྟ་སྟེ། ཨཾ་གུ་ཧ།
en: “My dhāraṇī is as follows:

source: ཨཾ་གུ་ཧ། ཌྷང་ག་པུ་ར་ཧ་ན། ཡ་མི་ཁ་ཁ་ཁ་ཁ། ཁ་ཁ་ཁ་བ་ཁ་བ། ཀླིན་ན་ཁ་བ་སྭཱ་ཧཱ།
en: aṃ guha aṃ guha dhaṅga pura hana yami kha kha kha kha kha kha khava khava klinnakhava svāhā

source: བཅོམ་ལྡན་འདས་འདི་དག་ནི་གལ་ཏེ་བདག་ཆོས་ཉན་པའམ། ཆོས་སྨྲ་བ་བསྲུང་བ་ནས། ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་མང་པོ་རྣམ་པར་འཕེལ་བས། ཚིམ་པར་བགྱི་བའི་བར་གྱི་སླད་དུ། དེར་མ་མཆིས་ན།
en: “Blessed One, if I do not come to support and satisfy those Dharma teachers and students with treasuries and granaries of wealth and grain, then I will have transgressed my vow.”

source: ཡི་དམ་ལས་འགལ་བར་འགྱུར་བ་ལགས་སོ། །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་ཐམས་ཅད་ཀྱིས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་རབ་ཏུ་བྱིན་ནོ།
en: All the blessed buddhas, bodhisattva great beings, gods, humans, and asuras expressed their approval of Brahmā , lord of the Sahā world.

source: །དེ་ནས་ཀཽ་ཤི་ཀས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ད་ལྟར་དང་། མ་མཆིས་པའི་དུས་ན་གྲོང་ངམ། གྲོང་ཁྱེར་གང་དང་གང་དུ་ཞེས་བྱ་བ་ནས། འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར་བདག་གིས་སྔོན་མ་ཐོས་པའི་བྲོ་བོར་བའི་དམ་བཅས་པ་དང་འགལ་བར་འགྱུར་ཞེས་བྱ་བའི་བར་དུའོ། །འདི་ལྟ་ལྟེ། ཁ་བ་མྲི་ཁ། ཁ་བ་མྲི་ཁ། ན་ལ་གྷ། ཨ་མུད་ཉ། ཨ་མུ་བ་ཧ། ཨ་ཀ་ཊ་ཊ།
en: Then Kauśika repeated Brahmā ’s vow and said, “My dhāraṇī is khavam rikha khavam rikha na lagha amudaña amuvaha akaṭaṭa akha aśakha jinavrakhe svāhā

source: ཨ་ཁ། ཨ་ཤ་ཁ། ཛི་ན་བྲ་ཁེ་སྭ་ཧཱ། བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་དམ་བཅས་པ་བཞིན་དུ་མ་བགྱིས་ན། འདི་ནི་བདག་གི་བྲོ་བོར་བའི་དམ་བཅས་པ་དང་འགལ་བར་འགྱུར་བ་ནས། མི་དང་། མི་མ་ཡིན་པ་དག་གིས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་པའི་བར་དུའོ། །དེ་ནས་འཕགས་སྐྱེས་པོས་ཀྱང་གསོལ་པ། བཅོམ་ལྡན་འདས་ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན། གྲོང་གི་བར་དུ་གང་དང་གང་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྲུང་བ་མ་བགྱིས་ན། བཅོམ་ལྡན་འདས་འདི་ནི་བདག་གིས་བྲོ་བོར་བའི་དམ་བཅས་པ་དང་འགལ་བར་འགྱུར་ལགས་སོ། །འདི་ལྟ་སྟེ།
en: Blessed One, if I do not follow through on my pledge, then I will have transgressed my vows.” Everyone then expressed their approval of Śakra, lord of the gods.

source: ཨུ་ཁ་ན་བ་ན་བ་ས་བ་ན། ས་མུ་དྲ་སང་ངིད་གཛྙཱ་ཏ་ཐ་ཙྱུད་ཏ། བ་རུ་ཎ་བ་བ་རཱ་ཛཱ་སྭཱ་ཧཱ། མི་དང་མི་མ་ཡིན་པའི་བར་གྱིས་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་རབ་ཏུ་བྱིན་ནོ། །དེ་ནས་མིག་མི་བཟང་གིས་ཀྱང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན་གྲོང་གི་བར་དུ་གང་དང་གང་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྲུང་བར་མ་བགྱིས་ན། བཅོམ་ལྡན་འདས་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱན་སྔར་བདག་གིས་བྲོ་བོར་བའི་དམ་བཅས་པ་དང་འགལ་བར་འགྱུར་བ་ལགས་སོ། །འདི་ལྟ་སྟེ། ཛལཽ་གྷ། ཨ་ཏོ་གྷ། ཨ་མ་མ།
en: Next Virūḍhaka spoke up as well, repeating the same vow before saying, “My dhāraṇī is ukhana­vana vasa­vana samudra­saṅṅidjña tathachyudta varuṇa vavārājā svāhā!” Everyone also expressed their approval of Virūḍhaka, the great king.

source: མོ་གྷ། ཨ་མ་ས་རཱ་ཛ་ན་ཙརྱ་ཡ་མུ་ཛ་སྭ་ཧཱ། དེ་ནས་མི་དང་མི་མ་ཡིན་པའི་བར་གྱིས་རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ལ་ལེགས་སོ་ཞེས་བྱ་བ་རབ་ཏུ་བྱིན་ནོ། །དེ་ནས་ཡང་ཡུལ་འཁོར་སྲུང་གིས་ཀྱང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་ན། གྲོང་གི་བར་དུ་གང་དང་གང་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྲུང་བ་མ་བགྱིས་ན། བཅོམ་ལྡན་འདས་འདི་ནི་བདག་གིས་བྲོ་བོར་བའི་དམ་བཅས་པ་དང་འགལ་བར་འགྱུར་བ་ལགས་སོ། །འདི་ལྟ་སྟེ། བིན་དུ་ཛ་བ་ཁ་བ། ཛ་བ་ར་མུ་ཁ།
en: Now Virūpākṣa spoke up, repeating the same vow before saying, “My dhāraṇī is jalaugha atogha amama mogha amasarājana­caryayamuja svāhā !” Everyone expressed their approval of Virūpākṣa, the great king.

source: ཀྵ་སཱ་ར། པུ་ཀ་བ་ཧ། ཨ་མཱརྒ་བ་ཊ་སྭ་ཧཱ། མི་དང་མི་མ་ཡིན་པའི་བར་གྱིས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་ལ་ལེགས་སོ་ཞེས་བྱ་བ་རབ་ཏུ་བྱིན་ནོ། །དེ་ནས་ལུས་ངན་པོས་ཀྱང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་ན། གྲོང་གི་བར་དུ་གང་དང་གང་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྲུང་བ་མ་བགྱིས་ན། བཅོམ་ལྡན་འདས་འདི་ནི་བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བྲོ་བོར་བའི་དམ་བཅས་པ་དང་འགལ་བར་འགྱུར་བ་ལགས་སོ། །འདི་ལྟ་སྟེ། ཀྵུ་ཏྲེ་ཀྵུ་ཀྵུ་ཀྵུ་ཏྲེ། ཁ་ཀྵུ་ཏྲེ། ཨ་ཏི་ཀྵུ་ཏྲེ། ཨ་ན་ཡ་ན་ཀྵུ་ཏྲེ། ཧྲྀ་ད་ཀྵུ་ཏྲེ། ས་ག་ར་ཧྲྀད་ཀྵུ་ཏྲེ། སཾ་ཀུ་སུ་ཀྵུ་ཏྲེ། དྷརྨ་ཀྵ་ཡ་མུ་ཏྲེ་སྭཱ་ཧཱ།
en: Next Dhṛtarāṣṭra spoke up as well, repeating the same vow before saying, “My dhāraṇī is bindu­java khava javara­mukha kṣa sāra pukavaha amārgavaṭa svāhā!” Everyone expressed their approval of Dhṛtarāṣṭra, the great king.

source: མི་དང་མི་མ་ཡིན་པའི་བར་གྱིས་རྒྱལ་པོ་ཆེན་པོ་ལུས་ངན་པོ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་རབ་ཏུ་བྱིན་ཏོ།
en: Then Kubera spoke up as well, repeating the same vow before saying, “My dhāraṇī is kṣutre kṣu kṣu kṣutre kha kṣutre atikṣutre anayana­kṣutre hrīda­kṣutre sagara­hrīda­kṣutre saṃkusu­kṣutre dharma­kṣaya­mutre svāhā !” Everyone also expressed their approval of Kubera, the great king.

source: །ཡང་དེའི་ཚེ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་གནས་པའི་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་འདི་ན་ཡོངས་སུ་སྐྱོང་བ་སྟོང་ཉིས་བརྒྱ་དང་། གཞན་ཡང་གླིང་བཞི་པ་གཞན་ན་གནས་པ་བཞི་ཁྲི་དང་། གཞན་ཡང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྫུ་འཕྲུལ་ཆེ་བ། རྫུ་འཕྲུལ་ཆེ་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་ན། དམ་པའི་ཆོས་ཀྱི་སྒྲོན་མའི་བར་དུ་ནུབ་པར་འགྱུར་བའི་ཚེ། གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། རི་བྲག་གམ། ཕོ་བྲང་འཁོར་ཏམ། དགོན་པའི་གནས་སམ། རྒྱལ་པོའི་ཕོ་བྲང་ངམ། བྲམ་ཟེའི་ཁྱིམའམ། ཚོང་དཔོན་གྱི་ཁྱིམའམ། བདག་ཉིད་ཆེན་པོའི་ཁྱིམའམ། དམངས་ཀྱི་ཁྱིམ་གང་དང་གང་དུ་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་ཆོས་སྨྲ་བ་དང་། གཞན་ཡང་དད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤིན་ཏུ་ཁྲུས་བགྱིས་ཏེ། ཡན་ལག་ཤིན་ཏུ་བྱུགས་ནས། གོས་སར་པ་བགོས་ཏེ། མེ་ཏོག་བཀྲམ་པའི་འཁོར་གྱི་ཁྱམས་སུ་རས་བཅོས་བུ་སྣ་ཚོགས་བཏིང་བ། སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་པ།
en: After this, twelve hundred great yakṣa commanders who live in this world system of four continents and guard it;

source: རོ་བྲོ་བ་སྣ་ཚོགས་ཀྱིས་བལྟམ་པས་བརྒྱན་པའི་སེང་གེའི་ཁྲི་ལ་མཆིས་ཏེ།
en: forty thousand who live in other four-continent systems;

source: གཟུངས་ཀྱི་ཕྱག་རྒྱའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྕེའི་རྩེ་མོས་གཞན་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་དམ། གླེགས་བམ་ལ་བྲིས་ཏེ། ཀློག་པར་གལ་ཏེ་བདག་ཅག་རེ་རེ་ཞིང་ཡང་འཁོར་བརྒྱ་སྟོང་དུ་མས་བསྐོར་ནས་མ་མཆིས་སམ། དེར་ཆོས་ཉན་པའམ་ཆོས་སྨྲ་བ་བསྲུང་བ་དང་རང་གི་འཁོར་བསྲུང་བ་དང་། སེམས་ཅན་གཞན་ཡང་བསྲུང་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ་གྲོང་ངམ། གྲོང་རྡལ་ནས་དམངས་ཀྱི་ཁྱིམ་གྱི་བར་དེ་དག་ཏུ་མ་མཆིས་སམ།
en: and other gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas of great magical power all said with one voice, “Blessed One, now or in the future, as long as this sacred Dharma lamp still shines, should a Dharma teacher, or a faithful noble son or daughter—whether a monk or a nun, a layman or a laywoman—in any village, town, city, country, border town, capital, forest, palace, brahmin household, merchant household, aristocratic household, or common household, first bathe, anoint their body, and put on new garments and then, in a courtyard adorned with various flowers and censed with fragrant incense, take a seat on a lion throne that is covered with fine fabrics and linens and surrounded by delicious foods and teach this dhāraṇī-seal extensively to others from the tip of their tongue or, alternatively, write it down or read it, if any one of us does not come surrounded by hundreds of thousands of members in our retinues to such places to protect the Dharma teacher and the students, protect their assemblies, protect other beings, and bring beings to maturity;

source: འཁོར་དང་བཅས་པས་བཀའ་མ་མནོས་སམ། ཡོངས་སུ་མ་བསྐྱངས་སམ།
en: or if we and our retinues do not heed their command and protect them;

source: དེར་སེམས་ཅན་རྣམས་ཀྱི་ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་མང་པོ་རབ་ཏུ་མ་བལྟམའམ།
en: or if we do not come there and fill their treasuries and granaries with much wealth and grain;

source: དེར་མ་མཆིས་སམ། དེར་སེམས་ཅན་རྣམས་ཀྱི་འཐབ་པ་དང་། རྩོད་པ་དང་། མུ་གེ་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ལགས་པའི་ཆར་པ་དང་། རླུང་དང་། ཤིན་ཏུ་གྲང་བ་དང་། ཚ་བ་རྣམས་མ་བཟློག་ན། བདག་ཅག་གིས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་བསླུས་པ་དང་། འཁུས་པ་དང་། མཉེས་པར་མ་བགྱིས་པར་འགྱུར་ཏེ།
en: or if we do not avert beings’ discord, quarrels, famines, diseases, foreign invasions, untimely rains, storms, cold snaps, and heatwaves, then we will have deceived, betrayed, and displeased the blessed buddhas of the past, present, and future.

source: ལུས་ལ་ཤ་བཀྲས་བཏབ་པ་དང་། ལྟ་བ་ཡོངས་སུ་ཉམས་པ་དང་། ལུས་རུལ་བར་འགྱུར་རོ།
en: Our bodies will then be struck by leprosy, our sight will deteriorate, and our bodies will rot.

source: །བདག་ཅག་གཡོག་དང་བཅས་པས། ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན་ཡང་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་ཆོས་ཀྱི་ཚུལ་འདི་འབར་བར་བགྱིའོ།
en: We and our retinues will propagate this Dharma method of the blessed thus-gone Śākyamuni in both the present and the future in this four-continent world.

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པར་བགྱིའོ།
en: We will teach this Dharma discourse.

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་དད་པའི་གང་ཟག་རྣམས་བསྲུང་བར་བགྱིའོ།
en: We will protect people who have faith in this Dharma discourse.

source: །ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: We will nurture them.

source: །ཡོངས་སུ་སྨིན་པར་བགྱིའོ། །ངན་པར་བགྱིས་པའི་ལས་ཡོངས་སུ་སྦྱང་བའི་སླད་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པར་ཆོས་སྨྲ་བའི་གང་ཟག་དེ་ལ་བསྐུལ་བར་བགྱིའོ།
en: We will make them mature. We will encourage any Dharma teacher to teach this Dharma discourse in order to purify bad actions.

source: །ཆོས་སྨྲ་བ་དང་། ཆོས་ཉན་པ་དེ་དག་གི་ནོར་དང་། འབྲུ་དང་། ལོངས་སྤྱོད་དང་། ཀུན་སྤྱོད་པ་རྣམ་པར་འཕེལ་བ་བསྒྲུབ་པར་བགྱིའོ།
en: We will cause the wealth, grain harvests, enjoyments, and pleasures of these Dharma teachers and students to increase.

source: །རྒྱལ་བའི་བསྟན་པ་མི་འཇིག་པའི་ཆོས་སུ་གཟུང་བར་བགྱིའོ།
en: We will support the doctrine of the victorious ones so that it is not destroyed.”

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་མི་དང་མི་མ་ཡིན་པ་དེ་དག་ཐམས་ཅད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: Hearing this, all the blessed buddhas applauded all the human and nonhuman beings.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྟད་མོ་ཅན་གྱིས་ཞུས་པ། བཅོམ་ལྡན་འདས་འདི་ཅི་ལགས།
en: The bodhisattva Kautūhalika, the great being, asked the thus-gone Śākyamuni, “Blessed One, what is this?

source: གང་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་པོ་འདིར་འདུས་པ་ཐམས་ཅད་འཁོར་དང་བཅས་པ་ལགས་སམ།
en: Are all the billions of māras here with their retinues?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Yes, they are here with their retinues,” the Blessed One replied.

source: ཐམས་ཅད་འཁོར་དང་བཅས་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་ལྟད་མོ་ཅན་གྱིས་གསོལ་པ། ཅི་འཁོར་དང་བཅས་པ་ཐམས་ཅད་ཀྱིས་དཀོན་མཆོག་གསུམ་ལ་དད་པ་ཐོབ་པ་ལགས་སམ།
en: The bodhisattva Kautūhalika then asked, “Have all of them and their retinues developed faith in the Three Jewels?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ནི་མ་ཡིན་ནོ།
en: “No, O noble son!” answered the Blessed One.

source: །བདུད་སྡིག་ཅན་གཡོག་སྟོང་ཡོད་པ་འདི་དད་པ་མ་ཐོབ་སྟེ།
en: Māra , the evil one, who has thousands of servants, has not developed faith.

source: འཁྲུགས་ཤིང་ཡིད་མི་དགའ་ནས་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་ན་ཡང་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཇི་སྲིད་འབར་བ་དེ་སྲིད་དུ་འདི་གླགས་ལྟ་ཞིང་སྐབས་ཚོལ་ཏེ།
en: He is outraged and frustrated now and will still be so in the future. He will wait and watch for the opportunity, for as long as this method of the sacred Dharma is glorified, to strive to bring about its destruction and disappearance.

source: དམ་པའི་ཆོས་ཀྱི་ཚུལ་གཞིག་པ་དང་ནུབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱེད་དོ། །དེ་བཞིན་དུ་གཡོག་ཁྲི་སུམ་སྟོང་ཡོད་པའི་བདུད་བཅོ་བརྒྱད་དང་། གཡོག་ཉི་ཤུ་རྩ་གཅིག་ཡོད་པ་ཉིས་བརྒྱ་པོ་འདི་དག་ཀྱང་གཡོག་དང་བཅས་པ་དཀོན་མཆོག་གསུམ་ལ་དད་པ་མ་ཐོབ་སྟེ།
en: Likewise, the eighty māras with their thirteen thousand servants, and the two hundred māras with their twenty-one servants, have not developed faith in the Three Jewels.

source: འཁྲུགས་ཤིང་ཡིད་མི་དགའ་བས་འདི་དག་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་ན་ཡང་ཇི་སྲིད་དུ་དམ་པའི་ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་རྒྱས་པ་དེ་སྲིད་དུ་འདི་དག་ངའི་བསྟན་པ་ལ་གླགས་ལྟ་ཞིང་སྐབས་ཚོལ་ཏེ།
en: They are outraged and frustrated now and will still be so in the future. As long as this method of the sacred Dharma proliferates, they will wait and watch for the opportunity to harm my doctrine.

source: དམ་པའི་ཆོས་ཀྱི་ཚུལ་གཞིག་པ་དང་། ནུབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱེད་དོ།
en: They will strive to destroy and obliterate it.

source: སྔོན་ཆད་ཁོན་དུ་བཟུང་བ་དང་། དགེ་བའི་རྩ་བ་མ་སྐྱེད་པ་དང་། མི་དགེ་བའི་གྲོགས་པོས་ཡོངས་སུ་ཟིན་པ་དང་། དགེ་བས་སྐྱོ་ཞིང་མྱ་ངན་ལས་འདས་པའི་བདེ་བ་མི་འདོད་པ་དང་། སྨོན་ལམ་མ་བཏབ་པའི་ཕྱིར།
en: “It is because they are under the sway of their previous enmity. They have not planted any roots of virtue, have been taken in by evil companions, have no desire for the happiness of nirvāṇa, and are discouraged by virtue.

source: སེམས་དང་སེམས་མཚམས་མི་སྦྱོར། དད་པར་མི་བྱེད། གནས་པར་མི་བྱེད། རབ་ཏུ་གཏོང་བར་མི་བྱེད་དོ།
en: Because they have not made any aspirations, they are unable to put their thoughts together, cannot be faithful, are never pleased, and do not become liberated.

source: །སངས་རྒྱས་འདུས་པ་ཆེན་པོ་འདི་ལྟ་བུ་མཐོང་བ་དང་། གཟུངས་ཟབ་མོ་འདི་ལྟ་བུ་ཐོས་པས་རྒྱུ་དེ་ཉིད་ཀྱིས་ཕྱིན་ཆད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་དད་པ་རབ་ཏུ་རྙེད་པར་འགྱུར་རོ།
en: However, simply because they have seen this great gathering of the buddhas and heard this profound dhāraṇī discourse, they will later develop faith in unsurpassable and perfect awakening.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྟད་མོ་ཅན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གལ་ཏེ་སེམས་ཅན་དགེ་བའི་རྩ་བ་མ་བསྐྲུན་པ་རྣམས་ཀྱི་རྣ་ལམ་དུ་གྲག་པར་གྱུར་པ་ན་ཡང་། དེ་ཉིད་དེ་དག་གི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུར་འགྱུར་བ་ནི། བཅོམ་ལྡན་འདས་ཤིན་ཏུ་ངོ་མཚར་ཏོ།
en: “Blessed One, it is incredible,” marveled the bodhisattva Kautūhalika, “that if beings who have not produced roots of virtue hear this Dharma discourse, that in itself becomes a cause for their unsurpassed and perfect awakening.

source: །བདེ་བར་གཤེགས་པ་ངོ་མཚར་ཏོ།
en: Blissful One, it is incredible.”

source: །ཡང་དེའི་ཚེ་བདུད་རི་བྱི་ཞེས་བྱ་བ་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། དཀོན་མཆོག་གསུམ་ལ་དད་པ་མི་ཉམས་པ་རྙེད་པར་གྱུར་པ།
en: At that time there was a māra named Agasti who had worshiped former victors, developed roots of virtue, discovered unfailing faith in the Three Jewels, and received his prophecy of unsurpassed and perfect awakening.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་པ་དེ་དྲང་སྲོང་ཆེན་པོའི་ཆ་བྱད་དུ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་འདུག་པར་གྱུར་ནས་དེ་སྟན་ལས་ལངས་ཏེ།
en: Appearing in the guise of a great sage, he sat before the thus-gone Śākyamuni.

source: ཀུན་ཏུ་བལྟས་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: He rose from his seat and, gazing ahead, joined his palms together.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སྟོབས་བསྐྱེད་པས། སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པ་འདི་དབྱངས་ཀྱིས་གང་བར་བྱས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་བདག་ལ་དགོངས་སུ་གསོལ།
en: Invigorated by the blessed buddhas, he filled the entire buddha field with his voice, saying, “Buddhas and bodhisattva great beings, please give me your attention!

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། བདུད་གཡོག་དང་བཅས་པ་རྣམས་ཀྱང་བདག་གི་ཚིག་འདི་ལ་གསོན་ཅིག །བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཐུགས་རྗེ་ཆེན་པོ་མངའ་བ།
en: Gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, nonhumans, māras and your retinues, heed my words! This teacher, the blessed Śākyamuni, is a lord of great compassion.

source: སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ཅན་ཐམས་ཅད་རྣམ་པར་གཅོད་པ།
en: He is a teacher who eliminates all degenerated buddha fields and perfects them with a complete array of positive attributes.

source: ཡོན་ཏན་བཀོད་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མཛད་པའི་སྟོན་པ་འདི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔ་དང་ལྡན་པ་འདི་ལྟ་བུར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་མཚམས་མ་མཆིས་པ་བགྱིད་པ་དམ་པའི་ཆོས་སྤོང་བ་འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་ངན་པར་སྤྱོད་པ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་རྒྱུད་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། ངན་སོང་གསུམ་ལས་ཤིན་ཏུ་བཟླ་བ་དང་། ཐེག་པ་གསུམ་ལ་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་བཟོད་པ་ལ་དགོད་པ་དང་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པར་བྱེད་པ་དང་དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་འཆད་པར་མཛད་པའི་སླད་དུ་ཞུགས་ཀྱིས་དེ་ལ་ཁྱེད་ཀྱིས་ཀྱང་ཅི་ནས་སྟོན་པའི་བསྟན་པ་ཡུན་རིང་དུ་གནས་པ་དང་། སངས་རྒྱས་ཀྱི་ཚུལ་འདི་ཡང་རྣམ་པར་མི་འཇིག་པའི་ཆོས་ཅན་དུ་འགྱུར་བ་དང་བསྒྲུབ་པ་དང་མི་ལྡན་པ་མ་གཏོགས་པར་ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན་ཡང་བདུད་དམ་བདུད་ཀྱི་འཁོར་སུས་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་གསུངས་པ་རྒྱལ་བའི་བསྟན་པ་འདི་ལ་སེམས་ཅན་འགའ་ཡང་འཚེ་བའམ།
en: It is through his past aspirations that he fully awakened to unsurpassed and perfect buddhahood in this kind of buddha field, which is rife with the afflictions and the five degenerations. Thus he proceeded to mature the minds of beings who have committed the acts of immediate retribution, who spurn the sacred Dharma, slander noble beings, develop roots of nonvirtue, and indulge in evil deeds. He set out to turn them back from the three lower realms, to bring them to maturity in the three vehicles, to establish them in absorption, dhāraṇī, and acceptance, to purify the buddha field, and to ensure that the lineage of the Three Jewels remains uninterrupted. “I implore you to ensure, by whatever means necessary, that this Teacher’s doctrine remains for a long time, so that this way of the buddhas is put into practice and does not perish. Otherwise, whether now or in the future, should this doctrine of the victors that the Thus-Gone One teaches be deprecated, threatened, or assailed by anyone, whether a māra or their retinue, then I implore you all to prevent this situation and dispel distractions and the obstacle to virtue.

source: རྣམ་པར་འཇིག་པའམ། ནུབ་པར་བགྱིད་པར་མི་འགྱུར་བ་དང་གང་དག་ཡང་དམ་པའི་ཆོས་འདི་འཛིན་པ་དང་། ཆོས་ལ་ནན་ཏན་བགྱིད་པ་དང་། ཆོས་སྨྲ་བ་དང་། ཆོས་ཉན་པའི་དགེ་སློང་ངམ།
en: The same applies should Māra , the sons or daughters of Māra , his male or female retinue, or his messengers wait and watch for the opportunity to harm those who uphold this sacred Dharma, who exert themselves in it or teach it;

source: དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། གཞན་ཡང་དད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལས་གསུམ་ལ་མངོན་པར་བརྩོན་པ་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ལ་དགའ་བ།
en: or if they do so to monks or nuns, laymen or laywomen, or any noble sons or daughters who have faith and listen to the Dharma;

source: དཀོན་མཆོག་གསུམ་ལ་མཆོད་པའི་ལས་ལ་མངོན་པར་བརྩོན་པ།
en: or if they do so to those who are diligent in body, speech, and mind, delight in the creation of merit, and exert themselves in acts of venerating the Three Jewels;

source: ཁམས་གསུམ་ན་སྤྱོད་པའི་ཉོན་མོངས་པ་སྤོང་བ་ལ་མངོན་པར་བརྩོན་པ།
en: or if they do so to those who exert themselves in discarding the afflictions ubiquitous in the three realms;

source: སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་གྱུར་པ། དེ་དག་ལ་ཡང་བདུད་དམ། བདུད་ཀྱི་བུའམ། བདུད་ཀྱི་བུ་མོའམ། བདུད་ཀྱི་འཁོར་ཏམ། བདུད་ཀྱི་འཁོར་མོའམ། བདུད་ཀྱི་ཕོ་ཉས་གཙེ་བའི་བསམ་པས་གླགས་ལྟ་བའམ།
en: or if they do so to those who seek to completely free all beings from suffering.

source: སྐབས་ཚོལ་དུ་མཆི་ཞིང་གཡེང་བ་དང་། དགེ་བའི་བར་ཆད་ཀྱི་ལས་བགྱིད་པར་མི་འགྱུར་བ་དེ་ལྟར་མཛོད་ཅིག །ད་ལྟར་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་གསོལ་ལོ།
en: “I pray to all the blessed buddhas of the present:

source: །བདག་ལ་ལས་ཀྱི་དངོས་གྲུབ་སྩལ་དུ་གསོལ།
en: please bestow the mastery of activity upon me!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། བདུད་ཀྱི་འཁོར་ཐམས་ཅད་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱང་བདག་ལ་ཐུགས་བརྩེ་བར་མཛོད་ཅིག །གང་སུ་དག་ད་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཏོགས་པའི་ས་ལ་གནས་པ་དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། སངས་རྒྱས་ཀྱི་བསྟན་པ་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ་བདག་ལ་ཐུགས་བརྩེ་བར་མཛོད་ཅིག །བདག་ལ་གསང་སྔགས་ཀྱི་དངོས་གྲུབ་སྩོལ་ཅིག་དང་། བདག་གིས་བདུད་དང་། བདུད་ཀྱི་འཁོར་དེ་ནན་ཏུར་གྱིས་ཚར་གཅད་པ་དང་། སེམས་འཁྲུགས་པ་དང་། ལུས་ལ་གནོད་པ་དང་། ལུས་སྤ་བཀོང་བ་དང་། རྫུ་འཕྲུལ་ཉམས་པར་བགྱི་བའི་སྔགས་བཤད་པར་བགྱི་སྟེ།
en: All bodhisattva great beings, retinues of Māra , gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans, please be on my side! All who abide on the earth within this buddha field, please be on my side in order to benefit all beings and ensure the longevity of the Buddha’s teaching, the way of the sacred Dharma. Bestow the mastery of mantra upon me! I shall then oppose Māra and his retinues by intoning a mantra that serves to destroy, disturb, harm, and intimidate them and destroy their magical powers.

source: དེས་བདུད་དང་། བདུད་ཀྱི་བུ་དང་། བདུད་ཀྱི་བུ་མོ་དང་། བདུད་ཀྱི་འཁོར་དང་། བདུད་ཀྱི་འཁོར་མོ་དང་། བདུད་ཀྱི་ཕོ་ཉ་གང་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་སེམས་མ་དད་པ་གཅིག་ཙམ་སྐྱེད་དམ། དགེ་སློང་ལ་འཚེ་བའམ། ཐ་ན་སྐད་ཅིག་གཅིག་ཙམ་ཡང་སེམས་འཁྲུག་པར་བགྱིད་པ་ནས།
en: This mantra will hurt Māra , the sons or daughters of Māra , his male or female retinue, and his messengers, should they persist in arousing just a single faithless attitude toward the blessed ones’ teaching, or should they develop intentions to harm a monk, or even disturb his mind and the like for a brief moment, or cross-examine him.
